---
kind: method
id: M:Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.Dispose
source: html/0cd5f375-65a6-315c-677d-79e71468a587.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.Dispose Method

Releases all resources used by the ConnectionInputPointInfo

## Syntax (C#)
```csharp
public void Dispose()
```